{"class_name": "Sequential", "keras_version": "1.1.1", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "name": "convolution2d_1", "trainable": true, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "batch_input_shape": [null, 66, 200, 3], "input_dtype": "float32", "nb_filter": 24, "W_regularizer": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_2", "trainable": true, "bias": true, "subsample": [2, 2], "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "nb_filter": 36, "W_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "border_mode": "valid", "init": "glorot_uniform", "name": "convolution2d_3", "trainable": true, "bias": true, "subsample": [1, 1], "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "nb_col": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "init": "glorot_uniform", "name": "dense_1", "trainable": true, "W_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "input_dim": null, "b_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 100, "activity_regularizer": null, "W_constraint": {"m": 4, "axis": 0, "name": "MaxNorm"}}}, {"class_name": "Dense", "config": {"activation": "relu", "init": "glorot_uniform", "name": "dense_2", "trainable": true, "W_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "input_dim": null, "b_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 50, "activity_regularizer": null, "W_constraint": {"m": 4, "axis": 0, "name": "MaxNorm"}}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "glorot_uniform", "name": "dense_3", "trainable": true, "W_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "input_dim": null, "b_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 10, "activity_regularizer": null, "W_constraint": {"m": 4, "axis": 0, "name": "MaxNorm"}}}, {"class_name": "Dense", "config": {"activation": "linear", "init": "glorot_uniform", "name": "dense_4", "trainable": true, "W_regularizer": {"l1": 0.0, "name": "WeightRegularizer", "l2": 0.009999999776482582}, "input_dim": null, "b_regularizer": null, "b_constraint": null, "bias": true, "output_dim": 1, "activity_regularizer": null, "W_constraint": {"m": 4, "axis": 0, "name": "MaxNorm"}}}]}